ask/10_million_questions_about_oop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-18 Mon 20:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>10 million question about OOP</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Quan Vu" />
<link rel="stylesheet" href="https://vhquan.github.io/css/style.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">10 million question about OOP</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd995f3d">1. Was object oriented programming revolutionary?</a></li>
<li><a href="#orgd72df24">2. What exactly is Object-oriented programming?</a>
<ul>
<li><a href="#orgecb2edb">2.1. 4 building blocks</a></li>
<li><a href="#org298feb9">2.2. 4 principles</a></li>
</ul>
</li>
<li><a href="#orgfa3e80f">3. What's the point of OOP?</a></li>
</ul>
</div>
</div>
<p>
the OO revolution (the object-oriented revolution)
</p>

<div id="outline-container-orgd995f3d" class="outline-2">
<h2 id="orgd995f3d"><span class="section-number-2">1</span> Was object oriented programming revolutionary?</h2>
<div class="outline-text-2" id="text-1">
<p>
&gt; It was certainly hyped that way back in the 1980s and 1990s. Thus, OOP became
the most widely used paradigm in the IT industry.
</p>

<p>
&gt; But I don't think it was revolutionary. It offered a better way to manage
program size and complexity than procedural programming. If offered a better
way to scale an application. That was enough. 
</p>

<p>
&gt; It was for some applications a great improvement. This is the reason it was
  invented (Simula 67). It was totally overhyped. Even in an OOP program, the
  real work is done by procedural code. OOP basically is packaging and
  glue. Useful, but not revolutionary.
</p>

<p>
&gt; Not really. With structured programming people had been collecting all the
  data associated with something (a file, a model or whatever) in things like
  C structs and passing pointers to the structs as arguments to functions
  associated with the data.
</p>

<p>
Things like Unix FILE handles were pointers to structs with buffers and
pointers to functions used for reading and writing those buffers to/from
disk. You had different functions for different types of devices.
</p>

<p>
So the translation of that into the idea of classes of objects responding
differently to messages wasn't really as much of a leap, in terms of
implementation, as was the paradigm shift in programmers heads that they were
now sending messages rather than calling functions. That paradigm and the idea
of inheritance became a fad that many languages adopted, with various degrees
of purity. I think it began with Simula, but I first saw a class browser in
Smalltalk. I was using a C library at the time and discovered that if I did a
global replacement of the word struct to class (and #defined it back to struct
for the C compiler), I could use a class browser designed for C++ on my C
library and see something very similar to inheritance within the library.
</p>
</div>
</div>

<div id="outline-container-orgd72df24" class="outline-2">
<h2 id="orgd72df24"><span class="section-number-2">2</span> What exactly is Object-oriented programming?</h2>
<div class="outline-text-2" id="text-2">
<p>
4 building blocks and 4 principles you need to know about OOP.
</p>
</div>
<div id="outline-container-orgecb2edb" class="outline-3">
<h3 id="orgecb2edb"><span class="section-number-3">2.1</span> 4 building blocks</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Class - these are user-defined data types that act as the blueprint for
objects, attributes, and methods.</li>
<li>Objects - These are instances of a class with specifically defined
data. When a class is defined initially, the description is the only object
that is defined.</li>
<li>Attributes - These are defined in the class template and represent the state
of an object. Objects contain data stored in the attribute field.</li>
<li>Methods - These are functions that are defined inside a class that describe
the behavior of an object. They are useful for reusability or keeping
functionality encapsulated inside one object at a time. Code re-usability is
a great benefit when debugging.</li>
</ol>
</div>
</div>
<div id="outline-container-org298feb9" class="outline-3">
<h3 id="org298feb9"><span class="section-number-3">2.2</span> 4 principles</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Inheritance</li>
<li>Encapsulation</li>
<li>Abstraction</li>
<li>Polymorphism</li>
</ol>

<p>
<a href="https://betterprogramming.pub/what-exactly-is-object-oriented-programming-b5758d7e8ff5">https://betterprogramming.pub/what-exactly-is-object-oriented-programming-b5758d7e8ff5</a>
<a href="https://www.freecodecamp.org/news/what-is-object-oriented-programming/">https://www.freecodecamp.org/news/what-is-object-oriented-programming/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgfa3e80f" class="outline-2">
<h2 id="orgfa3e80f"><span class="section-number-2">3</span> What's the point of OOP?</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://stackoverflow.com/questions/24270/whats-the-point-of-oop">https://stackoverflow.com/questions/24270/whats-the-point-of-oop</a>
<a href="https://stackoverflow.blog/2020/09/02/if-everyone-hates-it-why-is-oop-still-so-widely-spread/">https://stackoverflow.blog/2020/09/02/if-everyone-hates-it-why-is-oop-still-so-widely-spread/</a>
</p>
</div>
</div>
</div>
</body>
</html>
